# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [18]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [19]:
first_data_set = pd.Series(np.random.randint(1,5,100))
second_data_set = pd.Series(np.random.randint(1,4,100))
third_data_set = pd.Series(np.random.randint(10000,30000,100))

In [20]:
first_data_set

0     3
1     2
2     3
3     3
4     3
     ..
95    4
96    1
97    4
98    4
99    1
Length: 100, dtype: int32

In [21]:
second_data_set

0     2
1     3
2     3
3     2
4     1
     ..
95    3
96    1
97    2
98    1
99    2
Length: 100, dtype: int32

In [22]:
third_data_set

0     15267
1     20015
2     10998
3     17926
4     24592
      ...
95    11502
96    13577
97    25316
98    24790
99    23493
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [23]:
df = pd.DataFrame(pd.concat([first_data_set,second_data_set,third_data_set],axis=1))
df

    0  1      2
0   3  2  15267
1   2  3  20015
2   3  3  10998
3   3  2  17926
4   3  1  24592
.. .. ..    ...
95  4  3  11502
96  1  1  13577
97  4  2  25316
98  4  1  24790
99  1  2  23493

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [24]:
df.columns = ['bedrs','bathrs','price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       3       2            15267
1       2       3            20015
2       3       3            10998
3       3       2            17926
4       3       1            24592
..    ...     ...              ...
95      4       3            11502
96      1       1            13577
97      4       2            25316
98      4       1            24790
99      1       2            23493

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [25]:
bigcolumn = pd.concat([first_data_set,second_data_set,third_data_set])
bigcolumn

0         3
1         2
2         3
3         3
4         3
      ...
95    11502
96    13577
97    25316
98    24790
99    23493
Length: 300, dtype: int32

In [26]:
bigcolumn.to_frame()

        0
0       3
1       2
2       3
3       3
4       3
..    ...
95  11502
96  13577
97  25316
98  24790
99  23493

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [27]:
len(bigcolumn) # then will go after 99 and dont stop

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [28]:
bigcolumn.reset_index(drop=True).reindex(range(300))

0          3
1          2
2          3
3          3
4          3
       ...
295    11502
296    13577
297    25316
298    24790
299    23493
Length: 300, dtype: int32